# This is a headline

In [2]:
import numpy as np
import pandas as pd

a = pd.DataFrame(np.random.random((5, 2)), columns=['one', 'two'])
a.iloc[1, 1] = np.nan
a

        one       two
0  0.297291  0.926619
1  0.343943       NaN
2  0.093599  0.828143
3  0.180157  0.591538
4  0.851924  0.848052

In [3]:
b = pd.DataFrame(np.random.random((6, 3)), columns=['one', 'two', 'three'])
b.iloc[2, 2] = np.nan
b

        one       two     three
0  0.875018  0.070889  0.560404
1  0.114051  0.804908  0.217935
2  0.507413  0.396293       NaN
3  0.561374  0.771579  0.223741
4  0.169253  0.220939  0.366906
5  0.799360  0.007306  0.190473

In [10]:
location = ['AL', 'AL', 'NY', 'NY', 'NY', 'VA']
day = ['SUN', 'SUN', 'TUE', 'WED', 'SAT', 'SAT']
temp = [12.3, 14.1, 21.3, 20.9, 18.8, 16.5]
humidity = [31, 45, 41, 41, 49, 52]
states = pd.DataFrame(dict(location=location, day=day, 
                           temp=temp, humidity=humidity))
states.set_index(['location', 'day'], inplace=True)

In [13]:
states.groupby(level='location').mean(numeric_only=True)

               temp   humidity
location
AL        13.200000  38.000000
NY        20.333333  43.666667
VA        16.500000  52.000000